[‎23.‎10.‎2020 13:47]  Медведев Александр Евгеньевич:  
count(CASE WHEN "Сумма во внутренней валюте по кред" > 0 then 1
                        WHEN "Сумма во внутренней валюте по дебе" < 0 then 1
                        ELSE null 
                    END) AS "Количество_кредит", 
count(CASE WHEN "Сумма во внутренней валюте по дебе" > 0 then 1
                        WHEN "Сумма во внутренней валюте по кред" < 0 then 1
                        ELSE null 
                    END) - 
                count(CASE WHEN "Сумма во внутренней валюте по кред" > 0 then 1
                        WHEN "Сумма во внутренней валюте по дебе" < 0 then 1
                        ELSE null 
                    END) AS "Изменение количества" 
 
